{
  "name": "Multi-Package Manager Support",
  "description": "Cross-distribution package manager detection and installation",
  "githubIssue": "#7",
  "branchName": "develop",
  "status": "in_progress",
  "userStories": [
    {
      "id": "US-001",
      "title": "Package Manager Auto-Detection",
      "description": "As a system administrator on RHEL/AlmaLinux/Rocky Linux, I want backupd to automatically detect and use dnf/yum so that I can install backupd without manual dependency installation.",
      "priority": 1,
      "passes": true,
      "acceptanceCriteria": [
        "Script detects /etc/os-release or equivalent to identify distribution",
        "Correct package manager is selected based on detected OS",
        "Installation succeeds without user intervention on supported distros",
        "No hardcoded apt-get calls remain in the codebase"
      ]
    },
    {
      "id": "US-002",
      "title": "bzip2 Installation on RHEL-family",
      "description": "As a user on Rocky Linux 9, I want bzip2 to install automatically when needed for restic extraction so that the installation completes successfully.",
      "priority": 2,
      "passes": true,
      "acceptanceCriteria": [
        "bzip2 installs via dnf install -y bzip2 on RHEL 8+/Fedora",
        "bzip2 installs via yum install -y bzip2 on RHEL 7/CentOS 7",
        "Installation succeeds on AlmaLinux 8, AlmaLinux 9",
        "Installation succeeds on Rocky Linux 8, Rocky Linux 9"
      ]
    },
    {
      "id": "US-003",
      "title": "argon2 Installation Across Distros",
      "description": "As a security-conscious user on Arch Linux, I want argon2 to install automatically so that I get Argon2id encryption without manual setup.",
      "priority": 3,
      "passes": true,
      "acceptanceCriteria": [
        "argon2 installs via pacman -S --noconfirm argon2 on Arch",
        "argon2 installs via apk add argon2 on Alpine",
        "argon2 installs via zypper install -y argon2 on openSUSE",
        "Fallback message updated to show distro-appropriate install command"
      ]
    },
    {
      "id": "US-004",
      "title": "unzip Installation Across Distros",
      "description": "As a user on Fedora, I want unzip to install automatically during rclone installation so that remote sync setup works seamlessly.",
      "priority": 4,
      "passes": true,
      "acceptanceCriteria": [
        "unzip installs via appropriate package manager on all supported distros",
        "Both install.sh and lib/core.sh use the abstraction"
      ]
    },
    {
      "id": "US-005",
      "title": "Unsupported Distribution Handling",
      "description": "As a user on an unsupported/niche distribution, I want clear instructions on what to install manually so that I can still use backupd.",
      "priority": 5,
      "passes": false,
      "acceptanceCriteria": [
        "Unsupported distro is detected (not silently assumed)",
        "Warning message lists required packages: bzip2, argon2 (optional), unzip",
        "Script continues without attempting package installation",
        "No installation failure on unsupported distros (graceful skip)"
      ]
    },
    {
      "id": "US-006",
      "title": "Error Message Updates",
      "description": "As a user who sees an error about missing argon2, I want the error message to show the correct install command for my distro.",
      "priority": 6,
      "passes": false,
      "acceptanceCriteria": [
        "backupd.sh error messages detect distro and show correct command",
        "lib/crypto.sh error messages detect distro and show correct command",
        "Messages cover: apt, dnf, yum, pacman, apk, zypper"
      ]
    }
  ]
}
